// Напишите программу, которая будет принимать на
// вход два числа и выводить, является ли второе число
// кратным первому. Если число 2 не кратно числу 1, то
// программа выводит остаток от деления.
// 34, 5 -> не кратно, остаток 4
// 16, 4 -> кратно

Console.WriteLine("введите первое число - ");

Console.ReadLine();
int firstDigit = int.Parse(int = Console.ReadLine());
Console.WriteLine("введите второе число - ");
Console.ReadLine();
int secondDigit = int.Parse(int = Console.ReadLine());

if (firstDigit % secondDigit == 0)

Console.WriteLine($"firstDigit = {firstDigit}" == $"secondDigit = {secondDigit}");

if (firstDigit == secondDigit % 10)


onsole.WriteLine(num1 % num2 == 0 ? $"Кратно" : $"Остаток от деления {result}");
